import { NextPage } from "next"
import { useDocumentTitle } from "hooks/useDocumentTitle"

const General: NextPage = () => {
    useDocumentTitle("Условия использования учебного портала")

    return (
        <div className="wrapper terms show-animate">
            <p className="title">Условия использования учебного портала (далее – Портала) «Speenat»</p>
            <p className="sub-title">1. Общие положения</p>
            <p>
                1.1. ТОО «Speenat» (далее – «Speenat») предлагает Студент сети Интернет (далее – «Учащийся»)
                использовать Портал «Speenat», доступный по адресу <a href="https://speenat.kz/">https://speenat.kz/</a>{" "}
                (далее – «Портал»).
            </p>
            <p>1.2. Использование Портала регулируется настоящими Условиями, а также документами ТОО «Speenat»:</p>
            <p className="left">Учащимся соглашением Порталов Портала (speenat.kz );</p>
            <p className="left"> Политикой конфиденциальности (speenat.kz).</p>
            <p>
                1.3. Начиная использовать Портал/его отдельные функции, Учащийся считается принявшим настоящие Условия,
                а также условия всех указанных выше документов, в полном объеме, без всяких оговорок и исключений. В
                случае несогласия Учащегося с какими-либо из положений указанных документов, Учащийся не вправе
                использовать Портал.
            </p>
            <p>
                1.4. Настоящие Условия, равно как и указанные выше документы, могут быть изменены Порталом без
                какого-либо специального уведомления, новая редакция Условий вступает в силу с момента ее размещения в
                сети Интернет по указанному в настоящем пункте адресу, если иное не предусмотрено новой редакцией
                Условий. Действующая редакция Условий всегда находится на странице по адресу: ITB Company.online, если в
                Условиях не указано иное.
            </p>
            <p>
                1.5. В случае если Порталом были внесены какие-либо изменения в настоящие Условия в порядке,
                предусмотренном п. 1.4. настоящих Условий, с которыми Учащийся не согласен, он обязан прекратить
                использование Портала.
            </p>
            <p>
                1.6. Портал предлагает Учащемуся возможность обратиться к партнёрам Портала за получением платных
                медицинских консультаций с применением телемедицинских технологий (далее – «Консультации»), общей
                информации по ветеринарным вопросам (далее – «Информационные услуги»), осуществить поиск информации о
                лекарственных препаратах, а также осуществить иные действия, предусмотренные явными функциями Портала.
                Все существующие на данный момент функции Портала, а также любое развитие их и/или добавление новых
                является предметом настоящих Условий. Под «партнёром Портала» в разделах 1 и 2 настоящих Условиях также
                понимается Портал в случаях, когда Консультации и/или Информационные услуги оказываются непосредственно
                Порталом.
            </p>
            <p>
                1.7. Портал и Учащийся настоящим согласовали, что в рамках Портала они взаимно признают электронные
                документы, подписанные простой электронной подписью, равнозначными документам на бумажных носителях,
                подписанным собственноручной подписью.
            </p>
            <p>
                1.7.1. Портал, в том числе, представляет собой информационную систему, оператором которой является
                Портал.
            </p>
            <p>
                1.7.2. Для подписания электронного документа электронной подписью в рамках Портала, Учащийся использует
                авторизацию на Портале с использованием, в зависимости от выбора Учащегося:
            </p>
            <p className="left">
                числовых, буквенных, символьных или комбинированных кодов, сформированных Порталом и полученные Учащимся
                в виде сообщения на номер телефона, указанный Учащимся при регистрации (авторизации) в Портале, которые
                необходимо ввести в специальное поле на Портале; логина и пароля от аккаунтов на Портале;
            </p>
            <p>Такие коды, логины и пароли являются ключом электронной подписи.</p>
            <p>1.7.3. Учащийся обязан соблюдать конфиденциальность в отношении ключей электронной подписи.</p>
            <p>
                1.7.4. Стороны признают, что все электронные документы, сформированные, используемые и направляемые
                Порталу Учащимся посредством функций Портала в рамках одной сессии (пока Учащийся является
                авторизованным на Портале), являются подписанными таким образом электронной подписью Учащегося.
                Подписание документов на Портале может происходить в том числе посредством проставления Учащимся в
                рамках одной сессии специального символа (галочки) напротив соответствующего документа (ссылки на
                документ).
            </p>
            <p>
                1.7.5. Стороны согласовали, что все действия и электронные документы, сделанные и направленные Порталу с
                использованием ключа электронной подписи Учащегося, считаются сделанными и направленными Учазимся.
            </p>
            <p>
                1.8. Портал может предоставить Учащемуся перевод настоящих Условий с русского и казахского языка, на
                другие языки, однако в случае противоречия между положениями Условий на русском языке и их переводом,
                юридическую силу имеет русскоязычная и казахская версия Условий.
            </p>
            <p className="sub-title">2. Использование Портала. Отдельные функции Портала</p>
            <p>2.1. Портал предоставляется Учащемуся для личного некоммерческого использования.</p>
            <p>
                2.2. Для использования всех или некоторых функций Портала Учащемуся необходимо использовать аккаунт,
                путем авторизации на Портале с помощью учетной записи Учащегося на Порталах ТОО «ITB Company».
            </p>
            <p>
                2.3. Портал предоставляет Учащемуся функциональную возможность обратиться к партнёрам Портала за
                получением Консультаций и/или Информационных услуг на следующих условиях:
            </p>
            <p>
                2.3.1. Консультации и/или Информационные услуги оказываются партнёрами за плату. Цена определяется
                согласно тарифам, которые доводятся партнёром Портала до Учащегося посредством Портала.
            </p>
            <p>
                2.3.2. Консультации оказываются Учащемуся в соответствии с договором возмездного оказания медицинских
                услуг, заключаемым между партнёром Портала и Учащимся. Текст договора доводится до сведения Учащегося
                перед обращением Учащегося за получением Консультации у партнёра Портала.
            </p>
            <p>
                2.3.3. Информационные услуги оказываются Учащемуся в соответствии с договором возмездного оказания
                информационных услуг, заключаемым между партнёром Портала и Учащимся. Текст договора доводится до
                сведения Учащегося перед обращением Учащегося за получением Информационной услуги у партнёра Портала.
            </p>
            <p>
                2.3.4. Консультации и/или Информационные услуги оказываются партнёрами Портала, указанными на
                соответствующей странице Портала и/или в соответствующих договорах (возмездного оказания медицинских
                услуг, возмездного оказания информационных услуг), заключаемых между партнёрами Портала и Учащимся.
                Список партнёров Портала доступен по адресу speenat.kz.
            </p>
            <p>
                2.3.5. Оплата Консультаций и/или Информационных услуг осуществляется Учащимся посредством Портала, при
                этом Портал является получателем платежа, действует по поручению партнёров Портала и уполномочен ими
                принимать от Учащегося денежные средства в счет оплаты Консультаций и/или Информационных услуг с
                привлечением уполномоченного оператора по приему платежей, или оператора электронных денежных средств,
                или иных участников расчетов, информационно-технологического взаимодействия. Портал не гарантирует
                отсутствия ошибок и сбоев в отношении предоставления возможности безналичной оплаты. Портал не является
                платёжным агентом в соответствии с законодательством Республики Казахстан.
            </p>
            <p>
                2.3.6. Оплату Консультаций и/или Информационных услуг Учащийся осуществляет банковской картой, указанной
                в интерфейсе Портала (далее – «Привязанная карта»). Для целей настоящих Условий любая банковская карта,
                привязанная в интерфейсе Портала или в учетной записи Учащегося на Порталах (включая мобильные
                приложения) ТОО «ITB Company» (его аффилированных лиц) (в том числе привязанная при авторизации на
                Портале, до авторизации на Портале, либо после) считается Привязанной картой. Портал вправе списать
                сумму, составляющую стоимость Консультаций и/или Информационных услуг с любой Привязанной карты.
            </p>
            <p>
                Порядок использования иных Порталов ТОО «ITB Company» и его аффилированных лиц, программ для мобильных
                устройств Портала, ТОО «ITB Company» и его аффилированных лиц (в том числе программы «ITB Company»),
                регулируется правилами таких Порталов и программ Портала, ТОО «ITB Company», его аффилированных лиц.
            </p>
            <p>
                Для подтверждения действительности Привязанной карты может осуществляется осуществляться списание
                (блокировка) суммы в пределах 1000 тенге, которая в случае успешного прохождения транзакции возвращается
                Учащемуся. Неуспешная попытка списания указанной суммы означает невозможность добавления данной
                Привязанной карты и/или недоступность функции безналичной оплаты соответственно.
            </p>
            <p>
                2.3.7. Оплата Консультация и/или Информационных услуг может быть также осуществлена Учащимся (при
                доступности Учащемуся соответствующей функции) с использованием Порталов третьих лиц, поддерживающих
                интеграцию с Порталом и участниками расчетов, и обеспечивающих авторизацию платежа Учащегося без
                передачи информации о Привязанной карте Порталу. Порядок использования Порталов третьих лиц, указанных в
                настоящем пункте, регулируется правилами таких Порталов третьих лиц. Портал не несет ответственности за
                использование Учащимся Порталов третьих лиц и не гарантирует корректность и безопасность работы таких
                Порталов третьих лиц.
            </p>
            <p>
                2.3.8. При оплате Консультаций и/или Информационных услуг возможно проведение как одной транзакции на
                полную стоимость Консультаций и/или Информационных услуг, так и нескольких транзакций на отдельные части
                стоимости Консультаций и/или Информационных услуг.
            </p>
            <p>
                2.4. Портал предоставляет Учащемуся функциональную возможность доступа к истории действий Учащегося на
                Портале, а также в программе «ConsulDoc» для мобильных устройств, предоставляемой Учащемуся на условиях
                Лицензионного соглашения (ссылка на соглашение), при условии, что Учащимся на Портале и в программе «ITB
                Company» используется один и тот же аккаунт (учетная запись).
            </p>
            <p>
                В указанном случае Учащемуся, помимо истории получения у партнёров Портала Информационных услуг, может
                быть предоставлена возможность:
            </p>
            <p className="left">
                просмотра всех предварительных записей в медицинские организации, которые Учащийся осуществил
                посредством программы «ITB Company». Такая история формируется автоматически на основе введенных
                Учащимся в программе «» данных и не является подтверждением факта визита Учащегося в медицинскую
                организацию;
            </p>
            <p>
                просмотра иной информации, предусмотренной функциональными возможностями Портала и программы «ITB
                Company».
            </p>
            <p>
                2.5. Портал предоставляет Учащемуся возможность перехода к информационным разделам Портала («Статьи»,
                «Услуги», «Лекарства» и др.), предоставляемых ТОО «ITB Company» по адресу: consudoc.online. Учащийся
                вправе осуществлять использование материалов информационных разделов на условиях Учащегося соглашения
                Порталов Портала, опубликованных по адресу: speenat.kz. Портал/ТОО "Портал" не являются создателями
                материалов, доступных в информационных разделах Портала, материалы предоставляется лицами, указанными на
                соответствующей странице Портала.
            </p>
            <p>
                Портал/ТОО "Портал" не несет ответственности за полноту, актуальность, корректность, достоверность
                содержащейся в материалах информации.
            </p>
            <p>
                По всем вопросам, связанным с содержанием информационных материалов, Учащийся может обратиться по
                адресу: support@speenat.kz.
            </p>
            <p>
                2.6. Если Портал предоставляет Учащемуся функциональную возможность, не описанную в настоящих Условиях,
                но доступную и описанную в Лицензионном соглашении на использование программы «ITB Company» для
                мобильных устройств (consudoc.online), то такое Лицензионное соглашение в указанной части (при
                отсутствии противоречий с настоящими Условиями) является неотъемлемой частью настоящих Условий.
            </p>
            <p>
                2.7. Учащийся дает Порталу согласие на обработку персональной информации Учащегося, как этот термин
                определен в Политике конфиденциальности (consudoc.online), Порталом для целей предоставления
                функциональных возможностей Портала, на обработку и передачу Порталом персональной информации Учащегося
                партнёрам Портала (равно как и на получение от партнёров Портала такой информации от партнёров Портала),
                оказывающим Учащемуся Консультации и/или Информационные услуги, и их уполномоченным представителям для
                дальнейшей обработки такой информации в целях предоставления Учащемуся функциональной возможности
                получения Учащимся от таких партнёров Портала Консультаций и/или Информационных услуг и в целях оказания
                медицинской помощи, в том числе в медико-профилактических целях, в целях установления медицинского
                диагноза, оказания медицинских и медико-социальных услуг при условии, что обработка персональных данных
                осуществляется лицом, профессионально занимающимся медицинской деятельностью и обязанным в соответствии
                с законодательством Республики Казахстан сохранять врачебную тайну. Портал передаёт лишь ту персональную
                информацию Учащегося, которая необходима для указанной цели. Обработка Порталом персональной информации
                Учащегося, а также иной информации, загружаемой, передаваемой и предоставляемой Учащимся посредством
                Портала, осуществляется на условиях Политики конфиденциальности, размещенной в сети Интернет по адресу
                consudoc.online, в части, не противоречащей настоящим Условиям.
            </p>
            <p>
                Положения настоящего пункта в отношении обработки персональной и иной информации Учащегося Порталом
                распространяются на материалы и информацию, полученные или переданные Учащимся в процессе использования
                Портала и его функций.
            </p>
            <p>
                Функциональные возможности Портала и программы «ITB Company» для мобильных устройств могут совпадать, в
                связи с чем ранее данное Учащимся согласие на обработку персональной информации в рамках использования
                Учащимся программы «ITB Company» актуально и действительно для использования Учащимся Портала.
            </p>
            <p>
                2.8. Учащийся настоящим уведомлен, понимает и соглашается с тем, что при использовании Портала для целей
                предоставления Учащемуся функциональных возможностей Портала Порталу в автоматическом режиме анонимно
                передается следующая информация: тип операционной системы устройства Учащегося, версия и идентификатор
                браузера, статистика использования функций Портала, данные местонахождения устройства (если применимо),
                а также иная техническая информация.
            </p>
            <p>
                2.9. Учащийся соглашается с тем, что размещенные им на Портале отзывы (комментарии, оценки) могут быть
                опубликованы и использованы Порталом и ТОО «ITB Company» (каждым в отдельности) в том числе в иных
                Порталах и приложениях Портала и ТОО «ITB Company», в рекламных или маркетинговых материалах,
                размещаемых на ресурсах Портала и ТОО «ITB Company» в сети Интернет, а также на иных ресурсах и сайтах в
                сети Интернет, для привлечения внимания других пользователей к Порталу в целом или к иным приложениям и
                Порталам Портала и ТОО «ITB Company», товарам, работам и услугам третьих лиц, как с указанием автора
                отзыва (комментария, оценки) (в качестве имени автора при этом будет указываться имя (логин, псевдоним)
                Учащегося, которое он указал при регистрации или в настройках своих данных в соответствующем разделе
                Портала), так и без этого, без обязанности предоставлять отчеты об использовании таких отзывов
                (комментариев, оценок), без необходимости получения специального разрешения Учащегося и без выплаты
                авторского вознаграждения, на территории всего мира без ограничения срока, с правом Портала и ТОО «ITB
                Company» вносить в отзывы (комментарии, оценки) изменения (сокращения, дополнения), снабжать их
                иллюстрациями (предисловием, послесловием, комментариями или какими бы то ни было пояснениями),
                использовать совместно с результатами интеллектуальной деятельности любых лиц, вне зависимости от
                художественной ценности таких результатов, в любой последовательности, а также с правом Портала о ТОО
                «ITB Company» предоставить указанные права использования таких отзывов (комментариев, оценок) третьим
                лицам. При этом Учащийся признает и соглашается, что Портал и ТОО «ITB Company» не обязаны просматривать
                такие отзывы (комментарии, оценки), а их использование указанными способами в указанных целях может
                осуществляться автоматически посредством программных средств. В случае если Учащийся не вправе
                предоставить Порталу и ТОО «ITB Company» право использования какого-либо отзыва (комментария, оценки)
                подобным способом, он обязан воздержаться от размещения такого отзыва (комментария, оценки). Учащийся
                несет ответственность за достоверность сведений, содержащихся в оставленных им отзывах (комментариях,
                оценках). Действие настоящего пункта распространяется на все, в том числе ранее оставленные, отзывы
                (комментарии, оценки) на Портале.
            </p>
            <p>
                Учащийся осознаёт и понимает, что, оставляя на Портале отзывы (комментарии, оценки), Учащийся тем самым
                делает их общедоступными.
            </p>
            <p>
                2.10. Учащийся уведомлен и согласен с тем, что в целях контроля качества Портал вправе проводить
                исследования переданной и полученной Учащимся информации в обезличенном агрегированном виде без
                возможности отнести такую информацию к прямо или косвенно определенному, или определяемому Учащемуся.
            </p>
            <p>
                2.11. Пользуясь Порталом, Учащийся дает свое согласие на получение информационных сообщений. Учащийся
                вправе отказаться от получения информационных сообщений путём обращения в службу технической поддержки
                по адресу support@speenat.kz .
            </p>
            <p>
                2.12. В случаях, предусмотренных действующим законодательством, при расчетах за Информационные услуги с
                помощью Портала кассовый чек направляется на адрес электронной почты, указанный Учащимся при авторизации
                в Портале, либо на абонентский номер, указанный Учащимся при использовании Портала.
            </p>
            <p>
                Учащийся осознаёт и понимает, что, оставляя на Портале отзывы (комментарии, оценки), Учащийся тем самым
                делает их общедоступными.
            </p>
            <p>
                2.10. Учащийся уведомлен и согласен с тем, что в целях контроля качества Портал вправе проводить
                исследования переданной и полученной Учащимся информации в обезличенном агрегированном виде без
                возможности отнести такую информацию к прямо или косвенно определенному, или определяемому Учащемуся.
            </p>
            <p>
                2.11. Пользуясь Порталом, Учащийся дает свое согласие на получение информационных сообщений. Учащийся
                вправе отказаться от получения информационных сообщений путём обращения в службу технической поддержки
                по адресу support@speenat.kz .
            </p>
            <p>
                2.12. В случаях, предусмотренных действующим законодательством, при расчетах за Информационные услуги с
                помощью Портала кассовый чек направляется на адрес электронной почты, указанный Учащимся при авторизации
                в Портале, либо на абонентский номер, указанный Учащимся при использовании Портала.
            </p>
            <p className="sub-title">3. Прочие условия</p>
            <p>
                3.1. Портал, предоставляя функциональные возможности по обеспечению информационного взаимодействия между
                Учащимся и партнёрами Портала, не является представителем партнёра Портала, в связи с чем не гарантирует
                получение Учащимся Консультации и/или Информационной услуги и качество таких услуг.
            </p>
            <p>
                3.2. Портал не несет ответственности за правильность введения данных Учащимся при использовании Портала
                и последствия таких действий Учащегося, за содержание, корректность и/или актуальность информации,
                предоставленной третьими лицами (в том числе партнёрами Портала) и доступной на Портале, а также за
                убытки, причиненные Учащемуся в результате предоставления такой информации и получения Учащимся
                Консультаций и/или Информационных услуг у партнёров Портала.
            </p>
            <p>
                3.3. Портал оставляет за собой право на свое усмотрение ограничить доступ Учащегося к Порталу (или к
                определенным функциям Портала, если это возможно технологически) с использованием его учетной записи или
                полностью заблокировать учетную запись Учащегося при неоднократном нарушении настоящих Условий, либо
                применить к Учащемуся иные меры с целью соблюдения требований законодательства или прав и законных
                интересов третьих лиц.
            </p>
        </div>
    )
}

export default General

export const getStaticProps = () => {
    return {
        props: {},
    }
}
