import { NextPage } from "next";

const Offer: NextPage = () => {

        return (
                <div className="wrapper terms show-animate">
                        <p className="title">
                                ПУБЛИЧНАЯ ОФЕРТА
                        </p>
                        <p className="title">
                                на оказание информационных услуг на Учебном портале «Speenat.kz»
                        </p>
                        <p>
                                Настоящий документ является официальным предложением ТОО «ITB Company»,
                                именуемого в дальнейшем - «Учебный портал», на заключение договора об
                                оказании информационных услуг, которое адресуется юридическим и физическим лицам
                                и именуется в дальнейшем - «Оферта». Заключение договора осуществляется путем принятия
                                юридическим или физическим лицом всех условий настоящей Оферты в определенном ею порядке и именуется в дальнейшем – «Акцепт».
                        </p>
                        <p className="sub-title">1. Общие положения:</p>
                        <p>
                                1.1. Данный текст является публичной Офертой в соответствии с пунктом 5 статьи 395
                                Гражданского кодекса Республики Казахстан и означает предложение широкому кругу лиц
                                о заключении договора на оказание информационных услуг, далее – «Договор». Настоящая Оферта содержит
                                все существенные условия Договора и адресуется любому лицу. Акцепт настоящей Оферты осуществляется
                                посредством действий лица, заинтересованного в заключении договора об оказании информационных услуг,
                                именуемого далее – «Учебный консультант» с использованием Интернет-сервиса и посредством регистрации
                                в личном кабинете по адресу cabinet.consudoc.online c целью размещения информации для поиска потенциальных
                                клиентов, заключения договоров купли-продажи и оказания услуг между Учебным консультантом и клиентами,
                                именуемыми далее – «Пользователи», либо посредством самостоятельного размещения Учебным консультантом
                                информации о себе и своих продуктах на указанном Учебном портале. Акцепт настоящей Оферты осуществляется в
                                соответствии со статьей 396 Гражданского кодекса Республики Казахстан.
                        </p>
                        <p>
                                1.2. В связи с вышеизложенным, просим Вас внимательно ознакомиться с текстом настоящей Оферты и, если вы не согласны с ее условиями, воздержаться от ее последующего Акцепта. 
                        </p>
                        <p className="sub-title">2. Предмет оферты:</p>
                        <p>
                                2.1 Предметом настоящей Оферты являются информационные услуги, предоставляемые
                                Учебному консультанту Учебным порталом с использованием Интернета и программно-технических
                                возможностей для установления контактов, и совершения сделок между поставщиком и приобретателями товаров и
                                услуг (предоставление торговой площадки, функционирующей в Интернете в режиме реального времени) с использованием
                                разработанного Учебным порталом программного обеспечения.
                        </p>
                        <p className="sub-title">3. Условия и порядок предоставления информационных услуг:</p>
                        <p>
                                3.1. Учебный портал предоставляет свои услуги в том виде, в котором они разработаны и доступны на
                                момент заключения Договора с использованием настоящей Оферты. При этом, Учебный портал имеет
                                право на одностороннее самостоятельное изменение внешней визуализации и алгоритма действий по предоставлении
                                информационных услуг Учебному консультанту.
                        </p>
                        <p>3.2. Учебный портал оказывает услуги Учебному консультанту только при выполнении следующих условий:</p>
                        <p className="left">
                                3.2.1. Учебный консультант осуществил Акцепт в соответствии с п.1.1настоящей Оферты.
                        </p>
                        <p className="left">
                                3.2.2. Учебный консультант предоставил Учебному порталу информацию, не являющуюся запрещенной к распространению в
                                Республике Казахстан и эта информация, также, соответствует требованиям Учебного портала для ее размещения на
                                Интернет-Учебный портале и программных приложениях (iOs и Android) Учебного портала www.speenat.kz,
                                именуемом в дальнейшем – «Учебный портал».
                        </p>
                        <p>
                                3.3. В случае, если информационные материалы Учебного консультанта предоставлены с нарушением 
                                правил и требований настоящей Оферты, а также не соответствуют требованиям действующего законодательства Республики Казахстан, 
                                Учебный портал вправе отказать в их размещении.
                        </p>
                        <p>
                                3.4. Доступ к программному обеспечению предоставляется только после регистрации в личном
                                кабинете с набором функций программного обеспечения. При этом условия сотрудничества (срок,
                                стоимость, пакеты с программным обеспечением и их количество высылаются отдельно в коммерческом
                                предложении по электронной почте).
                        </p>
                        <p>
                                3.5. В случае нарушения Учебным консультантом оговоренных в настоящей Оферте условий и порядка предоставления
                                информационных услуг согласно коммерческому предложению, Учебный портал вправе не размещать информационные
                                материалы на Учебный портале вплоть до устранения Учебным консультантом нарушений.
                        </p>
                        <p className="sub-title">4. Права и обязанности сторон:</p>
                        <p>4.1. Учебный портал обязуется:</p>
                        <p className="left">4.1.1. Оказывать Учебному консультанту информационные услуги в соответствии с условиями заключенного Договора.</p>
                        <p>
                                4.1.2. Давать доступ к программному обеспечению и размещать информационные материалы Учебного консультанта на
                                Учебном портале на срок, индивидуально выбранный Учебным консультантом в его личном кабинете
                                Учебного портала в пределах опций, предоставленных Учебным порталом.
                        </p>
                        <p className="left">
                                4.1.3. Предоставлять отчет Учебному консультанту по результатам размещения
                                его информационных материалов, посредством электронной почты и при наличии запроса от Учебного консультанта.
                        </p>
                        <p className="left">
                                4.1.4. Публиковать на Учебный портале настоящую Оферту с актуальными изменениями и приложениями к ней, содержащими условия Договора.
                        </p>
                        <p className="left">
                                4.1.5. Уведомлять Учебного консультанта обо всех изменениях в Договоре не менее чем за 7 (семь) календарных дней до начала их
                                действия, путем опубликования вводимых изменений на Учебном портале и предоставления к ним доступа Учебному консультанту.
                        </p>
                        <p className="left">
                                4.1.6. Предоставлять Учебному консультанту консультации и разъяснения относительно пользования
                                Учебным порталом. Объем консультаций ограничивается конкретными вопросами, связанными с предоставлением информационных услуг и их оплатой.
                        </p>
                        <p className="left">
                                4.1.7. Вести учет, оказанных Учебному консультанту информационных услуг.
                        </p>
                        <p className="left">
                                4.1.8. При оказании информационных услуг по Договору обеспечить Учебному консультанту доступ к личному кабинету.
                        </p>
                        <p className="left">
                                4.1.9. Исполнять принятые на себя обязательства в соответствии с заключенным Договором.
                        </p>
                        <p className="left">
                                4.1.10. По факту оказанных информационных услуг в прошедшем календарном месяце, до 15 (пятнадцатого) числа месяца, следующего за отчетным,
                                предоставлять Учебному консультанту, в электронной форме, на его электронную почту, указанную в личном кабинет Учебного консультанта,
                                и/или на бумажном носителе, по фактическому адресу, указанному Учебным консультантом в его личном кабинете на Учебный портале,
                                Акт выполненных работ (оказанных услуг) за прошедший месяц, а также Акт сверки взаимных расчетов и Счет-фактуру, подписанные со стороны
                                Учебного портала. Подписание документов производится непосредственно уполномоченными лицами Сторон, либо с использованием
                                электронно-цифровой подписи (ЭЦП) в соответствии с законодательством Республики Казахстан.
                        </p>
                        <p className="left">
                                4.1.11. В течение 5 (пяти) рабочих дней после получения указанных в предыдущем пункте документов, Учебный консультант обязан подписать
                                Акт выполненных работ (оказанных услуг) за прошедший месяц, а также Акт сверки взаимных расчетов и направить по одному их экземпляру
                                Учебному порталу, либо представить Учебному порталу письменный мотивированный отказ от их подписания, с указанием причин.
                        </p>
                        <p className="left">
                                4.1.12. При наличии недостатков и/или ошибок в вышеуказанных документах, Учебный портал обязуется устранить их в течение 5 (пяти) рабочих дней
                                со дня получения соответствующих рекламаций от Учебного консультанта.
                        </p>
                        <p className="left">
                                4.1.13. Услуги считаются оказанными с момента подписания Сторонами Акта выполненных работ (оказанных услуг).
                        </p>
                        <p className="left">
                                4.1.14. Если, по истечении 5 (пяти) рабочих дней со дня получения Акта выполненных работ (оказанных услуг) от Сторон не поступило подписанных
                                Актов, либо мотивированных письменных отказов от их подписания, то услуги считаются оказанными Учебным порталом надлежащим
                                образом и принятыми Учебным консультантом в объемах, указанных в таких Актах, а указанные Акты, как таковые, считаются подписанными.
                        </p>
                        <p>4.2. Учебный портал имеет право:</p>
                        <p className="left">
                                4.2.1. Временно приостановить оказание Учебному консультанту информационных услуг по заключенному Договору для проведения запланированных
                                работ по обслуживанию технических и программных средств, используемых Учебным порталом для оказания Учебному консультанту
                                информационных услуг, а также для ликвидации аварий, сбоев и неполадок, препятствующих оказанию информационных услуг Учебному
                                консультанту. Учебный портал осуществляет обслуживание и устранение неполадок своих программно-технических ресурсов в наиболее
                                удобное для Учебного консультанта время. В случае, если планируемая продолжительность перерыва будет более 24 (двадцати четырех)
                                часов, то Учебный портал обязан, не менее чем за одни сутки до перерыва, уведомить Учебного консультанта о запланированных
                                перерывах, посредством публикации такой информации на Учебном портале.
                        </p>
                        <p className="left">
                                4.2.2. На основании Закона Республики Казахстане «О средствах массовой информации» отказать в размещении (либо удалить уже размещенную)
                                информацию, которая нарушает требования действующего законодательства Республики Казахстан, а равно и в случаях, если информация не
                                будет соответствовать действительности, либо искажает внешний вид страниц Учебного портала, либо вводить других пользователей
                                Учебного портала в заблуждение относительно персональных данных Учебного консультанта и предоставляемых им товаров и услуг.
                        </p>
                        <p className="left">
                                4.2.3. Расторгнуть заключенный Договор в одностороннем порядке в случае нарушения Учебный консультантом требований действующего законодательства Республики Казахстан.
                        </p>
                        <p className="left">
                                4.2.4. Приостановить оказание информационных услуг, в случае изменений условий заключенного Договора и условий размещения информационных материалов
                                Учебным консультантом, до согласования ими новых условий.
                        </p>
                        <p className="left">
                                4.2.5. Действует от своего имени, но за счет и по поручению Учебного консультанта. Учебный портал также вправе осуществлять свои обязательства самостоятельно,
                                либо с привлечением третьих лиц, оставаясь ответственным перед Учебный консультантом за их действия.
                        </p>
                        <p className="left">
                                4.2.6. Требовать от Учебного консультанта эксклюзивности предоставляемых информационных материалов (фото, отзывы, статьи и другие виды контента) без
                                права раскрытия их данных третьим лицам.
                        </p>
                        <p>4.3. Учебный консультант обязуется:</p>
                        <p className="left">
                                4.3.1. Предоставлять Учебному порталу все необходимые информационные материалы и документы, необходимые Учебному порталу для исполнения
                                принятых, по заключенному Договору, обязательств в срок, не позднее 7 (семи) рабочих дней до даты размещения информационных материалов на Учебном портале.
                        </p>
                        <p className="left">
                                4.3.2. Самостоятельно готовить информационные материалы для размещения их на Учебном портале.
                        </p>
                        <p className="left">4.3.3. Оплачивать услуги Учебного портала в соответствии с условиями заключенного Договора.</p>
                        <p className="left">
                                4.3.4. Знакомить Учебного портала, не реже 1(одного) раза в 7 (семь) календарных дней, с официальной информацией Учебного портала об изменениях заключенного Договора,
                                а также об иных технологических, дизайнерских, программных и организационных изменениях и мероприятиях, касающихся Учебного портала.
                        </p>
                        <p className="left">
                                4.3.5. При необходимости предоставлять Учебному порталу, по его требованию, документы, подтверждающие полномочия Учебного консультанта в отношении товаров,
                                товарных знаков и иных объектов интеллектуальной собственности, в отношении которых Учебным консультантом предоставляется Учебному
                                порталу информационный материал в целях размещения на Учебный портале.
                        </p>
                        <p className="left">
                                4.3.6. Выдать согласие на получение обновленной информации, информационных сообщений с последними новостями, новыми предложениями товаров и услуг, специальными
                                предложениями и объявлениями о продажах и услугах, а также информации о новостях и предложениях для партнеров Учебного портала, посредством
                                SMS-сообщений и электронной почты.
                        </p>
                        <p className="left">
                                4.3.7. При прохождении процедуры регистрации на Учебном портале, в том числе в автоматическом режиме, согласиться, что на его электронный
                                адрес будут направляться письма и сообщения, содержащие информацию о продуктах и услугах партнеров Учебного портала. Учебный
                                консультант также дает согласие Учебному порталу на передачу персональных данных Учебного консультанта и иных открытых сведений
                                о нем третьим лицам, в том числе организациям, которым принадлежат ресурсы:
                        </p>
                        <p className="left">
                                Учебный консультант согласен с тем, что consudoc.online.kz использует и обрабатывает данные Учебный консультанта.
                        </p>
                        <p className="left">
                                4.3.8. Предоставлять Учебному порталу эксклюзивные права на размещаемые на Учебном портале информационные материалы, без права
                                их распространения третьим лицам, если, изначально, на предоставляемые Учебному порталу информационные материалы, на уровне их
                                первоисточника, не был установлен запрет такой эксклюзивности.
                        </p>
                        <p>4.4. Учебный консультант имеет право:</p>
                        <p className="left">4.4.1. Следить за ходом и результатами оказания информационных услуг.</p>
                        <p className="left">4.4.2. На доступ к своим личным данным в личном кабинете на Учебном портале в порядке, определенном Учебным порталом.</p>
                        <p className="left">4.4.3.Пользоваться информационными услугами Учебного портала по своему выбору и в пределах, предоставленных Учебным порталом.</p>
                        <p className="left">4.4.4. С помощью личного кабинета знакомиться с объемом, оказанных Учебным порталом, информационных услуг.</p>
                        <p className="left">4.4.5. Вносить изменения и корректировки в информационные материалы не менее, чем за 7 (семь) рабочих дней до их предполагаемой публикации на Учебный портале</p>
                        <p className="left">
                                4.4.6. Досрочно приостановить информационные услуги с уведомлением Учебного консультанта не менее, чем за 7 (семь) рабочих дней, с возможность возврата,
                                оплаченных Учебным консультантом денежных средств (баланса) за неиспользованный период (Условия в коммерческом предложений). Для возврата
                                денежных средств Учебный консультант обязуется отправить Учебному порталу письменный запрос на возврат, с указанием неиспользованной суммы
                                баланса. В случае уведомления Учебного портала в срок менее, чем за 7 (семь) рабочих дней, оплаченные Учебным консультантом денежные средства
                                (баланс) возврату не подлежат.
                        </p>
                        <p className="sub-title">5. Стоимость услуг и порядок расчетов</p>
                        <p>
                                5.1. Стоимость предоставленных Учебным порталом услуг устанавливается в зависимости от количества купленных пакетов продвижения,
                                тип пакета продвижения и срока действия пакета продвижения. Стоимость пакетов продвижения, срок действия и тип пакета, указывается в
                                коммерческом предложении, высланном менеджером Учебного портала на электронную почту и/или в бумажном виде Учебному
                                консультанту. Учебный консультант обязуется самостоятельно ознакомиться с тарифами указанными в коммерческом предложении.
                        </p>
                        <p>5.2.Оплата услуг производиться посредством банковского перевода на счет юридического лица, собственника Учебного портала.</p>
                        <p>
                                5.3. Услуги считаются оплаченными Учебным консультантом с момента зачисления денежных средств на расчетный счет Учебного портала. Оплата производится в национальной валюте Республики Казахстан с
                                учетом условий конвертаций Национального Банка Республики Казахстан.
                        </p>
                        <p className="sub-title">6. Срок действия договора</p>
                        <p>6.1. Договор вступает в силу с момента Акцепта настоящей Оферты Учебным консультантом и действует до момента исполнения Сторонами всех принятых на себя обязательств.</p>
                        <p>6.2.Договор может быть расторгнут досрочно:</p>
                        <p className="left">6.2.1. По соглашению Сторон в любое время, в письменном виде.</p>
                        <p className="left">6.2.2. По иным основаниям, предусмотренным законодательством Республики Казахстан и заключенным Договором.</p>
                        <p className="left">6.2.3. При одностороннем отказе от Договора одной из Сторон, с уведомлением контрагента в срок не менее, чем за 10 (десять) рабочих дней до даты намеченного отказа от Договора.</p>
                        <p>6.3. Прекращение срока действия Договора по любому основанию не освобождает Стороны от ответственности за нарушения условий Договора, возникшие в течение срока его действия.</p>
                        <p className="sub-title">7. Ответственность сторон</p>
                        <p>
                                7.1. За неисполнение или ненадлежащее исполнение обязательств, принятых на себя по Договору, заключенному путем Акцепта (принятия) настоящей Оферты, Стороны несут ответственность, установленную
                                действующим законодательством Республики Казахстан и положениями указанного Договора.
                        </p>
                        <p>
                                7.2. Учебный консультант несет полную ответственность за законность происхождения (источников), предоставляемых им для размещения информационных материалов,
                                а также за соблюдение авторских и смежных с ними прав и прав потребителей. Все расходы Учебного портала, вызванные обоснованными имущественными
                                претензиями третьих лиц, в том числе авторов и обладателей смежных прав, в связи с размещением материалов, предоставленных Учебный консультантом,
                                полностью возмещаются Учебный консультантом при условии, что нарушение вышеуказанных прав вызвано его действиями.
                        </p>
                        <p>
                                7.3. В случае возникновения убытков у Учебного портала, в связи с нарушением Учебным консультантом законодательства и положений заключенного Договора, Учебный
                                консультант обязуется возместить Учебному порталу, причиненные нарушением убытки.
                        </p>
                        <p>
                                7.4. Учебный портал имеет право отказаться от оказания услуги при выявлении фактов предоставления Учебным консультантом недостоверной информации,
                                либо в случаях, когда информация получена Учебным консультантом не законным путем.
                        </p>
                        <p>
                                7.5. Уплата штрафных санкций не освобождает Стороны от выполнения принятых на себя обязательств и возмещения причиненных убытков.
                        </p>
                        <p> 7.7. Учебный портал не несет ответственности по заключенному им Договору за:</p>
                        <p className="left">7.7.1. какие-либо действия, являющиеся прямым или косвенным результатом действий Учебного консультанта;</p>
                        <p className="left">
                                7.7.2. убытки или упущенную выгоду Учебного консультанта и(или) третьих лиц вне зависимости от того, мог ли Учебный портал предвидеть возможность таких убытков или нет;
                        </p>
                        <p className="left">7.7.3. качество, предоставляемых Учебным консультантом информационных материалов.</p>
                        <p className="left">7.7.4. недостоверность информации, содержащейся в информационных материалах Учебного консультанта;</p>
                        <p className="left">7.7.5. качество работы линий связи, оборудования, программного обеспечения, Интернет- ресурсов и других сервисов, предоставляемых Учебному порталу третьими сторонами;</p>
                        <p className="left">7.7.6. отсутствие телефонных звонков или иных обращений от потенциальных клиентов в адрес Учебного консультанта;</p>
                        <p className="left">
                                7.7.7. возможные риски и условия безопасного использования Интернета, а также за сетевые атаки или взлом Учебного портала, в том числе, но не
                                ограничиваясь сбоями в его работе по техническим причинам.
                        </p>
                        <p>
                                7.8. Совокупная ответственность Учебного портала по заключенному Договору ограничивается суммой
                                платежа, уплаченного Учебному порталу Учебным консультантом по заключении Договора.
                        </p>
                        <p>
                                7.9. В момент Акцепта настоящей Оферты Учебный консультант принимает на себя всю ответственность (в том числе за действия своих работников и (или) иных лиц, осуществляющих регистрацию на Учебном портале (по поручению или с ведома
                                Учебного консультанта), связанную с использованием, полученных от Учебного портала регистрационных данных.
                        </p>
                        <p className="sub-title">8. Срок действия договора</p>
                        <p>
                                8.1. Стороны освобождаются от ответственности за неисполнение или ненадлежащее исполнение обязательств по заключенному Договору на время действия
                                форс-мажорных обстоятельств, под которыми понимаются войны, массовые беспорядки, военные учения, народные волнения, забастовки, воздействие
                                ядерного взрыва, радиации (ионизирующего излучения) или радиоактивного заражения от иных источников, техногенные катастрофы, насильственный захват
                                или насильственное удержание власти; террористические акты, эпидемии, государственные нормативные правовые акты, препятствующие исполнению обязательств
                                Сторонами. При этом, общеизвестные события не нуждаются в каком-либо подтверждении уполномоченными органами.
                        </p>
                        <p className="sub-title">9. Прочие условия</p>
                        <p>
                                9.1. Все споры и разногласия, вытекающие из договоров, заключенных путем Акцепта (принятия) настоящей Оферты, разрешаются путем
                                переговоров. В случае невозможности решения возникших споров в ходе переговоров, такие споры должны быть переданы на рассмотрение
                                судов Республики Казахстан при предварительном соблюдении претензионного порядка со сроком рассмотрения претензий в течение 10 (десяти)
                                рабочих дней. В случае возникновения вопросов, Учебный консультант может обратиться по адресу: г. Нур-Султан, район, ул., или посредством
                                электронной почты partners@speenat.kz.
                        </p>
                </div>
        )
}

export default Offer

export const getStaticProps = () => {
        return {
                props: {
                        
                }
        }
}